app/views/pages/profile.html.erb

                    <div class="col-sm-2" style="font-size: 100%; opacity: 0.7;">POSTS<br>
                      <h6 style="color: #0084B4; font-size: 150%;"><%= current_user.posts.count %></h6>
---
SELECT "posts".* FROM "posts" WHERE (user_id = 3)  ORDER BY "posts"."created_at" DESC
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 5]]

          <div class="col-sm-11">
            <p class="post-title"><span class="post-owner"><%= User.find(@p.user_id).username %></span> <span class=post-creation>- <%= @p.created_at.to_formatted_s(:short) %></span></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]