app/controllers/pages_controller.rb

  def home
    @posts = Post.all
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

  def profile
    #grab the username from the URL as :id
    if(User.find_by_username(params[:id]))
      @username = params[:id]
    else
      redirect_to root_path, :notice=> "User not found!"
    end
    @posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)
    @newPost = Post.new
    @toFollow = User.all.first(5)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "user"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT "posts".* FROM "posts" WHERE (user_id = 3)  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 5
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC

  def explore
    @posts = Post.all
    @newPost = Post.new
    @toFollow = User.all.first(5)
---
SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 5