app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id # assign the post to the user who created it.
        @poster = User.find(@post.user_id).username
        respond_to do |f|
            if (@post.save)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Submitted via Form!"], ["user_id", 3], ["created_at", "2016-03-10 13:06:58.853152"], ["updated_at", "2016-03-10 13:06:58.853152"]]